<!-- dflook/terraform-github-actions {"workspace":"tvm-ci-prod","backend":"05edb40ec190b603ceee2dcce2b3b39a26cec1f00de5eed3a4beaac3d9e32757","backend_type":"s3"} -->
Terraform plan in __.__ in the __tvm-ci-prod__ workspace
With var files: `vars/tvm-ci-prod.auto.tfvars
`
<details>
<summary>Plan: 1 to add, 7 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role_policy.autoscalers will be updated in-place
  ~ resource "aws_iam_role_policy" "autoscalers" {
        id     = "autoscalers_role:describeTags"
        name   = "describeTags"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "s3:DeleteObject",
                            "s3:GetObject",
                            "s3:ListBucket",
                            "s3:PutObject",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::tvm-sccache-prod/*"
                        Sid      = "SccacheAccess"
                    },
                  + {
                      + Action   = [
                          + "s3:DeleteObject",
                          + "s3:GetObject",
                          + "s3:ListBucket",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::jenkins-artifacts-prod/*"
                      + Sid      = "ArtifactsAccess"
                    },
                    {
                        Action   = [
                            "ecr:BatchCheckLayerAvailability",
                            "ecr:BatchGetImage",
                            "ecr:CompleteLayerUpload",
                            "ecr:DescribeImages",
                            "ecr:DescribeRepositories",
                            "ecr:GetDownloadUrlForLayer",
                            "ecr:InitiateLayerUpload",
                            "ecr:ListImages",
                            "ecr:PutImage",
                            "ecr:TagResource",
                            "ecr:UploadLayerPart",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:ecr:us-west-2:*"
                        Sid      = "ECRAccess1"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket.artifacts-bucket will be created
  + resource "aws_s3_bucket" "artifacts-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "tvm-jenkins-artifacts-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "tvm-jenkins-artifacts-prod"
        }
      + tags_all                    = {
          + "Name" = "tvm-jenkins-artifacts-prod"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "weekly_retention"

          + expiration {
              + days = 7
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-ARM"].aws_autoscaling_group.agents will be updated in-place
  ~ resource "aws_autoscaling_group" "agents" {
        id                        = "Prod-Autoscaler-Jenkins-ARM"
        name                      = "Prod-Autoscaler-Jenkins-ARM"
        # (22 unchanged attributes hidden)

      ~ mixed_instances_policy {

          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "8" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }
            # (1 unchanged block hidden)
        }
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-ARM"].aws_launch_template.autoscaler will be updated in-place
  ~ resource "aws_launch_template" "autoscaler" {
        id                      = "lt-0307dda3ecfec7907"
      ~ image_id                = "************************************************"
      ~ latest_version          = 8 -> (known after apply)
        name                    = "Prod-Autoscaler-Jenkins-ARM20220125202831343700000004"
        tags                    = {}
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-CPU"].aws_autoscaling_group.agents will be updated in-place
  ~ resource "aws_autoscaling_group" "agents" {
        id                        = "Prod-Autoscaler-Jenkins-CPU"
        name                      = "Prod-Autoscaler-Jenkins-CPU"
        # (22 unchanged attributes hidden)

      ~ mixed_instances_policy {

          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "9" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }
            # (1 unchanged block hidden)
        }
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-CPU"].aws_launch_template.autoscaler will be updated in-place
  ~ resource "aws_launch_template" "autoscaler" {
        id                      = "lt-084b74d77c2ee9ba2"
      ~ image_id                = "************************************************"
      ~ latest_version          = 9 -> (known after apply)
        name                    = "Prod-Autoscaler-Jenkins-CPU20220125202831342000000001"
        tags                    = {}
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-CPU-Small"].aws_autoscaling_group.agents will be updated in-place
  ~ resource "aws_autoscaling_group" "agents" {
        id                        = "Prod-Autoscaler-Jenkins-CPU-Small"
        name                      = "Prod-Autoscaler-Jenkins-CPU-Small"
        # (22 unchanged attributes hidden)

      - launch_template {
          - id      = "lt-02518d53b22a85dd8" -> null
          - name    = "Prod-Autoscaler-Jenkins-CPU-Small20220425184607394500000002" -> null
          - version = "2" -> null
        }

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 100
              + spot_allocation_strategy                 = "capacity-optimized"
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id = "********************"
                  + version            = (known after apply)
                }
            }
        }
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-CPU-Small"].aws_launch_template.autoscaler will be updated in-place
  ~ resource "aws_launch_template" "autoscaler" {
        id                      = "lt-02518d53b22a85dd8"
      ~ image_id                = "************************************************"
      ~ latest_version          = 2 -> (known after apply)
        name                    = "Prod-Autoscaler-Jenkins-CPU-Small20220425184607394500000002"
        tags                    = {}
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 7 to change, 0 to destroy.

Changes to Outputs:
  ~ fleet_config = <<-EOT
        jenkins:
          clouds: 
          
          - ec2Fleet:
              addNodeOnlyIfRunning: false
              alwaysReconnect: false
              cloudStatusIntervalSec: 10
              computerConnector:
                sSHConnector:
                  credentialsId: "jenkins"
                  launchTimeoutSeconds: 60
                  maxNumRetries: 10
                  port: 22
                  retryWaitTime: 15
                  sshHostKeyVerificationStrategy: "nonVerifyingKeyVerificationStrategy"
              disableTaskResubmit: false
              fleet: Prod-Autoscaler-Jenkins-ARM
              idleMinutes: 5
              initOnlineCheckIntervalSec: 15
              initOnlineTimeoutSec: 180
              labelString: "ARM"
              maxSize: 90
              maxTotalUses: -1
              minSize: 2
              name: "Prod-Autoscaler-Jenkins-ARM"
              noDelayProvision: true
              numExecutors: 1
              oldId: "803939ae-c6f8-4c7a-8386-0d1a9af631ad"
              privateIpUsed: true
              region: "us-west-2"
              restrictUsage: false
              scaleExecutorsByWeight: false
          
          - ec2Fleet:
              addNodeOnlyIfRunning: false
              alwaysReconnect: false
              cloudStatusIntervalSec: 10
              computerConnector:
                sSHConnector:
                  credentialsId: "jenkins"
                  launchTimeoutSeconds: 60
                  maxNumRetries: 10
                  port: 22
                  retryWaitTime: 15
                  sshHostKeyVerificationStrategy: "nonVerifyingKeyVerificationStrategy"
              disableTaskResubmit: false
              fleet: Prod-Autoscaler-Jenkins-CPU
              idleMinutes: 5
              initOnlineCheckIntervalSec: 15
              initOnlineTimeoutSec: 180
              labelString: "CPU"
              maxSize: 90
              maxTotalUses: -1
              minSize: 6
              name: "Prod-Autoscaler-Jenkins-CPU"
              noDelayProvision: true
              numExecutors: 1
              oldId: "803939ae-c6f8-4c7a-8386-0d1a9af631ad"
              privateIpUsed: true
              region: "us-west-2"
              restrictUsage: false
              scaleExecutorsByWeight: false
          
          - ec2Fleet:
              addNodeOnlyIfRunning: false
              alwaysReconnect: false
              cloudStatusIntervalSec: 10
              computerConnector:
                sSHConnector:
                  credentialsId: "jenkins"
                  launchTimeoutSeconds: 60
                  maxNumRetries: 10
                  port: 22
                  retryWaitTime: 15
                  sshHostKeyVerificationStrategy: "nonVerifyingKeyVerificationStrategy"
              disableTaskResubmit: false
              fleet: Prod-Autoscaler-Jenkins-CPU-Small
              idleMinutes: 5
              initOnlineCheckIntervalSec: 15
              initOnlineTimeoutSec: 180
              labelString: "CPU-SMALL"
      -       maxSize: 45
      +       maxSize: 100
              maxTotalUses: -1
              minSize: 0
              name: "Prod-Autoscaler-Jenkins-CPU-Small"
              noDelayProvision: true
              numExecutors: 1
              oldId: "803939ae-c6f8-4c7a-8386-0d1a9af631ad"
              privateIpUsed: true
              region: "us-west-2"
              restrictUsage: false
              scaleExecutorsByWeight: false
          
          - ec2Fleet:
              addNodeOnlyIfRunning: false
              alwaysReconnect: false
              cloudStatusIntervalSec: 10
              computerConnector:
                sSHConnector:
                  credentialsId: "jenkins"
                  launchTimeoutSeconds: 60
                  maxNumRetries: 10
                  port: 22
                  retryWaitTime: 15
                  sshHostKeyVerificationStrategy: "nonVerifyingKeyVerificationStrategy"
              disableTaskResubmit: false
              fleet: Prod-Autoscaler-Jenkins-GPU
              idleMinutes: 5
              initOnlineCheckIntervalSec: 15
              initOnlineTimeoutSec: 180
              labelString: "GPU"
              maxSize: 90
              maxTotalUses: -1
              minSize: 8
              name: "Prod-Autoscaler-Jenkins-GPU"
              noDelayProvision: true
              numExecutors: 1
              oldId: "803939ae-c6f8-4c7a-8386-0d1a9af631ad"
              privateIpUsed: true
              region: "us-west-2"
              restrictUsage: false
              scaleExecutorsByWeight: false
          
          - ec2Fleet:
              addNodeOnlyIfRunning: false
              alwaysReconnect: false
              cloudStatusIntervalSec: 10
              computerConnector:
                sSHConnector:
                  credentialsId: "jenkins"
                  launchTimeoutSeconds: 60
                  maxNumRetries: 10
                  port: 22
                  retryWaitTime: 15
                  sshHostKeyVerificationStrategy: "nonVerifyingKeyVerificationStrategy"
              disableTaskResubmit: false
              fleet: Prod-Autoscaler-Jenkins-GPU-4x
              idleMinutes: 5
              initOnlineCheckIntervalSec: 15
              initOnlineTimeoutSec: 180
              labelString: "GPU"
              maxSize: 2
              maxTotalUses: -1
              minSize: 2
              name: "Prod-Autoscaler-Jenkins-GPU-4x"
              noDelayProvision: true
              numExecutors: 1
              oldId: "803939ae-c6f8-4c7a-8386-0d1a9af631ad"
              privateIpUsed: true
              region: "us-west-2"
              restrictUsage: false
              scaleExecutorsByWeight: false
          
    EOT
```
</details>

:x: Error applying plan in [terraform #7](https://github.com/tlc-pack/ci-terraform/actions/runs/2354777096)